---
kind: method
id: M:Autodesk.Revit.DB.UV.IsZeroLength
source: html/6ee67976-561a-6401-297a-e3b31aa9dd0d.htm
---
# Autodesk.Revit.DB.UV.IsZeroLength Method

The boolean value indicates whether this 2-D vector is a zero vector.

## Syntax (C#)
```csharp
public bool IsZeroLength()
```

## Remarks
The zero vector's each component is zero within the tolerance (1.0e-09).